Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t
Serialization structure for Component Item Enumerator

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.MoreComponentItemsLeft
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.IndexToStart
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.nComponentItems
Number of the component items in the enumerator.

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.aComponentItemNumbers
Component numbers list.

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.aComponentItemTypes
Component types list.

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.aComponentItemVersionNumbers
Component version numbers list.

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.aComponentItemNames
Component names list.

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.aComponentItemUINames
Component UI names list.

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.aComponentItemDescriptions
Component descriptions list.

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.aAttributeFileExtensions
Component descriptions list.

Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t.ClientId
DO NOT USE! For internal usage only!